a = input().split()
b = int(input())
res = []
for i in range(0, len(a), b):
    res.append(a[i:i + b])              # i = 0
print(res)                              # Срез a[0:0+2] → a[0:2] → ['a', 'b']
                                        # Добавляем в результат.
                                        # i = 2
                                        # Срез a[2:2+2] → a[2:4] → ['c', 'd']
                                        # Добавляем в результат.
                                        # i = 4
                                        # Срез a[4:4+2] → a[4:6] → ['e', 'f']
                                        # Добавляем в результат.

