athletes = [('Дима', 10, 130, 35), ('Тимур', 11, 135, 39), ('Руслан', 9, 140, 33), ('Рустам', 10, 128, 30),
            ('Амир', 16, 170, 70), ('Рома', 16, 188, 100), ('Матвей', 17, 168, 68), ('Петя', 15, 190, 90)]

n = int(input())


def funk_1(athlete):        # В функцию передается кортеж, например ('Дима', 10, 130, 35)
    return athlete[n - 1]   # По индексу возвращается элемент кортежа


athletes.sort(key=funk_1)   # Элемент передается в key и по нему сортируется
for i in athletes:
    print(*i)
