# Множества
# Это совокупность объектов, понимаемых как единое целое.

# Подмножество и надмножество
# X={1,2,3}, Y={1,2,3,4,5}. Так как все элементы множества X содержатся в множестве Y, то мы говорим, что множество X является подмножеством множества Y.
# Множество X={1,2,3,6} не является подмножеством множества Y={1,2,3,4,5}, так как элемент 6 не содержится в Y.
# Если множество X является подмножеством множества Y, то также говорят, что множество Y является надмножеством множества X, а записывается это так: Y ⊃ X.

# Заметим, что любое множество также является подмножеством самого себя. Про такое подмножество говорят нестрогое подмножество:
# множество {1,2,3} является нестрогим подмножеством множества {1,2,3};
# множество {1,2,3} является строгим подмножеством множества {1,2,3,4}.

# Пустое множество - множества, не содержащего ни одного элемента.
# Примеры пустых множеств: множество лошадей, пасущихся на луне.

# Примечания
# Примечание 1. Множества – неупорядоченные совокупности, то есть неважно, в каком порядке указаны элементы множества.
# Примечание 2. Если множество X конечно, то через ∣X∣ обозначается количество элементов множества Х.
# Примечание 3. Если множество X содержит n элементов, то оно имеет 2**n подмножеств, включая пустое множество. Например, множество X={a,b,c} содержит 3 элемента и имеет 8 подмножеств: