xy = input()
y = '87654321'.index(xy[1])
x = 'abcdefgh'.index(xy[0])
matrix = [["."] * 8 for i in range(8)]
matrix[y][x] = 'N'
                                                # (y-i) — разница по вертикали между клеткой коня (y) и текущей клеткой (i) на доске.
for i in range(8):                                 # (x-j) — разница по горизонтали между клеткой коня (x) и текущей клеткой (j).
    for j in range(8):                              # Конь в шахматах ходит: на 2 клетки в одном направлении (по горизонтали или вертикали), и на 1 клетку в другом.
        if abs(y - i) * abs(x - j) == 2:            # (dx, dy) = (2, 1) или (1, 2)    dx * dy = 2 * 1 = 2
            matrix[i][j] = "*"

for row in matrix:
    print(*row)
