# Числовые множества

# Натуральные числа
# N={1,2,3,4,5,…}.
# Обратите внимание, число ноль не является натуральным числом.

# Целые числа
#Если к множеству натуральных чисел N присоединить те же числа с противоположным знаком и ноль, то получится множество целых чисел. Множество целых чисел обозначается буквой Z и содержит следующие числа:
# Z={0,±1,±2,±3,±4,±5,…}.
#  Множество натуральных чисел – подмножество множества целых чисел N ⊂ Z.

# Рациональные числа
# Рациональным числом в математике называется любое число, представимое в виде частного целого числа к натуральному. Множество рациональных чисел обозначается буквой Q и содержит следующие числа:
# Q = {n / m, m ∈ Z, n ∈ N}

# Иррациональные числа
# Не все числа в математике можно представить в виде рационального числа. Примером служат числа:
# 2 ≈ 1.414213562…;
# π ≈ 3.1415926535.;
# e ≈ 2.71828182845….

# Вещественные числа
# Объединение рациональных и иррациональных чисел образует множество вещественных чисел. Множество вещественных чисел R определяется так:
# R = Q ∪ I, где символ ∪ – означает объединение множеств.
# Геометрическая интерпретация множества вещественных чисел – это числовая прямая.
# Множество вещественных чисел также называют множеством действительных чисел.

# Множество комплексных чисел
# Комплексным числом в математике называется любое число, представимое в виде a+bi, где a и b – вещественные числа, а i = корень из −1 – мнимая единица. Множество комплексных чисел обозначается буквой C.
# Множество вещественных чисел является подмножеством множества комплексных чисел, так как любое   вещественное число можно представить в виде a + bi, где b = 0.
