letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---',
         '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---',
         '...--', '....-', '.....', '-....', '--...', '---..', '----.']

d = dict(zip(letters, morse))   # делаем словарь
text = input().upper()

for letter in text:             # достаем буквы и цифры из введенного текста
    if letter in d:                  # проверяем есть ли буква в словаре
        print(d[letter], end=" ")
